# Pandas: generated from Panel data-means multidimensional structured data

## pandas is a library and it is used for data manipulation and data analysis

## data is raw facts--we will extract meaningful information that wll be called data

## Types of Data
## 1.Numeric data--quantitative data 2. categorical data-qualitative data

## structured data-tabular form, we will use this in pandas

### unstructured data-no structure for ex-whatsapp

## In numeric there are two types 1. continuos data-any value in a range ex-height, weight 2--discrete=ratio(whole numbers) ,it is countable i.e.size of house

## In categorical-1.Nominal Data-no inherent order in categories ex-eyecolor 2. Ordinal data- categories have inherent order ex-job order,age group

# 02/11/22

## Reading and Writing

### csv-comma separated file

In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\ex1.csv")  ##to read the file pd.read_csv
df    ## use double backward slash or 1 single forward slash

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\ex1.csv",header=None) 
df     ## column names are changed(header=none)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

### to specify column names , use names=

In [6]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\ex1.csv",names=["first","second","third","fourth","five"]) 
df

  first second third fourth     five
0     a      b     c      d  message
1     1      2     3      4    hello
2     5      6     7      8    world
3     9     10    11     12      foo

In [4]:
type(df)

pandas.core.frame.DataFrame

### two type of data structure in pandas :1.data frame-tabular data with rows and columns(2-D) 2.series-single column is called as series(1-D)

### 0,1,2 is called as index
### a,b,c,d is called as column name or column header

### 1st row will be treated as column header

### data frame has given its own index i.e. 0,1,2 by default it starts with 0

## checking shape of data-shape will tell how many rows and columns are there

In [7]:
df.shape

(4, 5)

### to extract one column not all we will use df("name of column")

In [10]:
a=df["second"]
a

0     b
1     2
2     6
3    10
Name: second, dtype: object

In [11]:
type(a)    ## single column-series

pandas.core.series.Series

## to extract multiple columns df[["name of columns"]]

In [13]:
a1=df[["first","third"]]
a1

  first third
0     a     c
1     1     3
2     5     7
3     9    11

In [14]:
type(a1)

pandas.core.frame.DataFrame

In [18]:
## or for single column
df.second

0     b
1     2
2     6
3    10
Name: second, dtype: object

In [19]:
type(df[["second"]])  ##we made it 2-d that's why data frame

pandas.core.frame.DataFrame

## tsv-tab separated file

#### to read tabular data-read_table

In [22]:
df=pd.read_table("C:/Users/rupan/OneDrive/Desktop/test.tsv")  ##read_table for tsv
df

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [28]:
df=pd.read_table("C:/Users/rupan/OneDrive/Desktop/test.tsv",header=0)  
df

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [29]:
df=pd.read_table("C:\\Users\\rupan\\OneDrive\\Desktop\\ex1.csv") 
df  ## use separator to separate from commas

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [30]:
df=pd.read_table("C:\\Users\\rupan\\OneDrive\\Desktop\\ex1.csv",sep=",") 
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [33]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\ex2.csv")
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [34]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\ex2.csv",header=None,names=["a","b","c","d","e"])
df

   a   b   c   d      e
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [37]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\csv_mindex.csv")
df

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

## to make any column index, we will use index_col=["name of col"]

In [39]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\csv_mindex.csv",index_col=["key2"])
df

     key1  value1  value2
key2
a     one       1       2
b     one       3       4
c     one       5       6
d     one       7       8
a     two       9      10
b     two      11      12
c     two      13      14
d     two      15      16

In [41]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\csv_mindex.csv",index_col=["value1","key2"])
df

            key1  value2
value1 key2
1      a     one       2
3      b     one       4
5      c     one       6
7      d     one       8
9      a     two      10
11     b     two      12
13     c     two      14
15     d     two      16

## to read excel file-pd.read_excel

In [42]:
df=pd.read_excel("C:\\Users\\rupan\\OneDrive\\Desktop\\t1.xlsx")
df

   Unnamed: 0  height  age
0         NaN       2    3
1         NaN       4    4
2         NaN       6    5
3         NaN       8    6
4         NaN      10    7

In [43]:
df=pd.read_excel("C:\\Users\\rupan\\OneDrive\\Desktop\\t1.xlsx",sheet_name="d1") ## to read from specific sheet
df

   Unnamed: 0  height  age
0         NaN       2    3
1         NaN       4    4
2         NaN       6    5
3         NaN       8    6
4         NaN      10    7

### unnamed:0 is because 1st column is empty and col header is zero

### to drop the column- df.drop(columns=["name of col"])

In [49]:
df.drop(columns=["Unnamed: 0"])

   height  age
0       2    3
1       4    4
2       6    5
3       8    6
4      10    7

In [51]:
df ## changes are not happening in original file

   Unnamed: 0  height  age
0         NaN       2    3
1         NaN       4    4
2         NaN       6    5
3         NaN       8    6
4         NaN      10    7

## use inplace to change in original file

In [52]:
df.drop(columns=["Unnamed: 0"],inplace=True)

In [53]:
df

   height  age
0       2    3
1       4    4
2       6    5
3       8    6
4      10    7

## to delete multiple columns

In [54]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\csv_mindex.csv")
df

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [55]:
df.drop(columns=["key1","value1","value2"])

  key2
0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d

In [56]:
df

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [57]:
df.drop(columns=["key1","value1","value2"],inplace=True)

In [58]:
df

  key2
0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d

In [59]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\ex4.csv")
df

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

#### Nan means empty

## to remove irrelevant rows, use skiprows=[0,1,2]

In [60]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\ex4.csv",skiprows=[0,2,3])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [61]:
df=pd.read_csv("C:\\Users\\rupan\\OneDrive\\Desktop\\ex5.csv")
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

### we cannot leave empty data we have to clean it first

### either you can drop that row or col or you can fill the missing data

In [62]:
df.isnull() ## to check missing value

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [63]:
df.isnull().sum() ## gives count of missing values as per the column

something    0
a            0
b            0
c            1
d            0
message      1
dtype: int64

In [64]:
df.isnull().sum().sum() ## gives total missing value

2

## we have to clean the data col-wise so we will use df.isnull().sum()

## to check single col missing value

In [65]:
df["a"].isnull().sum()

0